Catalogs/Кластеры1С.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Кластеры1С</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСервераАдминистрирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСервераАдминистрирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательЦентральногоСервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольЦентральногоСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресКластера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортКластера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяАдминистратораКластера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольАдминистратораКластера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКластера</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Защищен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПлатформы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииПлатформы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочиеСерверыКластера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Кластеры1С/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтображениеЭлементов();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСвойстваИнформационныхБаз()

	//ПараметрыАдминистрированияКластера = ПолучитьПараметрыАдминистрированияКластера();
	//Возврат АдминистрированиеКластера.СвойстваИнформационныхБаз(Объект.ИдентификаторКластера, ПараметрыАдминистрированияКластера);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьОтображениеЭлементов()

		
КонецПроцедуры

&НаКлиенте
Процедура ТипПодключенияПриИзменении(Элемент)
	
	ОбновитьОтображениеЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПодключение(Команда)
	
	УстановитьПодключение();	

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПодключение()
	
	Отказ = Ложь;

	Если Не ЗначениеЗаполнено(Объект.АдресСервераАдминистрирования) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен адрес сервера", СтатусСообщения.Важное, , , , Отказ);
	КонецЕсли;  
	
	Если Не ЗначениеЗаполнено(Объект.ПортСервераАдминистрирования) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен порт сервера", СтатусСообщения.Важное, , , , Отказ);
	КонецЕсли;

	Если Не Отказ Тогда 
		//ПолучитьИдентификаторНаСервере();
		
		НачатьРегистрациюБазКластера();
		Оповестить("РегистрацияИнформационныхБаз", Объект.Ссылка);
		Закрыть();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторКластера) Тогда
		ПоказатьПредупреждение(, "Успешное подключение");
	Иначе
		ПоказатьПредупреждение(, "Не удалось подключиться");
	КонецЕсли;
	 	
КонецПроцедуры

&НаСервере
Процедура НачатьРегистрациюБазКластера()
	
	Записать();
		
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.КлючФоновогоЗадания = Строка(Объект.Ссылка.УникальныйИдентификатор());
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	ПараметрыВыполнения = ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "Справочники.Кластеры1С.СоздатьБазыПоДаннымКластера", Объект.Ссылка);
	Объект.ИдентификаторЗадания = ПараметрыВыполнения.ИдентификаторЗадания;
	Записать();
	
КонецПроцедуры // НачатьРегистрациюБазКластера()

&НаСервере
Функция ПолучитьИдентификаторНаСервере()
	
	ПараметрыКластера = АдминистрированиеСерверов.ПолучитьПараметрыКластера(Объект);
	
	Объект.ИдентификаторКластера = ПараметрыКластера.ИдентификаторКластера;
	Объект.ВерсияПлатформы = Справочники.ВерсииПлатформы.НайтиПоНаименованию(ПараметрыКластера.ВерсияПлатформы);	
	
	Объект.Наименование = ПараметрыКластера.ИмяКомпьютера;
	//#REF
	//---- Если кластеров на сервере несколько тогда предлагается выбрать кластер и присвивается имя кластера, 
	//		если кластер один, то присваивается имя компьютера
	//		
	//Объект.Наименование = ?(ПараметрыКластера.ИмяКомпьютера = ПараметрыКластера.Имя, 
	//						ПараметрыКластера.Имя,
	//						ПараметрыКластера.Имя + " (" + ПараметрыКластера.ИмяКомпьютера + ")");
							
	Объект.ПортКластера = ПараметрыКластера.Порт;
	
	Справочники.Кластеры1С.СоздатьБазыПоДаннымКластера(Объект.Ссылка);
	
КонецФункции   

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.ИдентификаторКластера) Тогда
		//УстановитьПодключение();		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСводнойИнформацииОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОбработки = Неопределено;
	Если Расшифровка.Свойство("ПараметрыБазы", ПараметрыОбработки) Тогда
		//ОбработатьРегистрациюИнформационнойБазы(ПараметрыОбработки);
		ДополнительныеПараметры = Новый Структура; 
		ДополнительныеПараметры.Вставить("ПараметрыБазы", ПараметрыОбработки);
		ДополнительныеПараметры.Вставить("Кластер", Объект.Ссылка);
		
		ОткрытьФорму("Справочник.ИнформационныеБазы.ФормаОбъекта", Новый Структура("ДополнительныеПараметры", ДополнительныеПараметры));
	КонецЕсли;
	
КонецПроцедуры
